# ArrayMixedModAndViewSpecElemsCorruption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ArrayFailures..::..ArrayMixedModAndViewSpecElemsCorruption Property
BuiltInFailures..::..ArrayFailures Class See Also
---
Unable to array this mixture of modeling and view specific elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ArrayMixedModAndViewSpecElemsCorruption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArrayMixedModAndViewSpecElemsCorruption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ArrayMixedModAndViewSpecElemsCorruption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ArrayFailures Class
Autodesk.Revit.DB Namespace